hyansuper/xdial_s3/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y
CONFIG_GMF_AUDIO_CODEC_DECODER_TYPE_RAW_OPUS=y
CONFIG_GMF_AUDIO_CODEC_DEC_OPUS_SAMPLE_RATE_24K=y
CONFIG_GMF_AUDIO_CODEC_DEC_OPUS_CHANNEL=1
CONFIG_GMF_AUDIO_CODEC_ENCODER_TYPE_OPUS=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_SAMPLE_RATE_24K=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_CHANNEL=1
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_FRAME_DURATION_60_MS=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_ENABLE_DTX=y
CONFIG_GMF_AUDIO_CODEC_ENC_OPUS_ENABLE_VBR=y
CONFIG_GMF_AUDIO_EFFECT_INIT_CH_CVT=n
CONFIG_GMF_AUDIO_EFFECT_RATE_CVT_DEST_RATE=24000
CONFIG_GMF_AUDIO_EFFECT_INIT_SONIC=y
CONFIG_GMF_AI_AUDIO_INIT_AEC=n
CONFIG_GMF_AI_AUDIO_INIT_WN=y
CONFIG_GMF_AI_AUDIO_WN_CH_ALLOCATION="M"
CONFIG_GMF_AI_AUDIO_INIT_AFE=y
CONFIG_GMF_AI_AUDIO_AFE_CH_ALLOCATION="M"
CONFIG_GMF_AI_AUDIO_WAKEUP_ENABLE=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
CONFIG_STOCK_EXTRA_INFO=n
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_SUPPORT_XRGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_ARGB8888=n
CONFIG_LV_DRAW_SW_SUPPORT_L8=n
CONFIG_LV_DRAW_SW_SUPPORT_AL88=n
CONFIG_LV_DRAW_SW_SUPPORT_A8=n
CONFIG_LV_DRAW_SW_SUPPORT_I1=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_USE_PRIVATE_API=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_XZ_NVS_PART_NAME_TO_SAVE_BOARD_INFO="xdial_nvs"
CONFIG_CODEC_ES7210_SUPPORT=n
CONFIG_CODEC_ES7243_SUPPORT=n
CONFIG_CODEC_ES7243E_SUPPORT=n
CONFIG_CODEC_ES8156_SUPPORT=n
CONFIG_CODEC_AW88298_SUPPORT=n
CONFIG_CODEC_ES8389_SUPPORT=n
CONFIG_CODEC_ES8374_SUPPORT=n
CONFIG_CODEC_ES8388_SUPPORT=n
CONFIG_CODEC_TAS5805M_SUPPORT=n
CONFIG_ESP_H264_DECODER_IRAM=n
CONFIG_VIDEO_DECODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_DECODER_SW_MJPEG_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_H264_SUPPORT=n
CONFIG_VIDEO_ENCODER_SW_MJPEG_SUPPORT=n
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
